# Условие
# Дано два числа a и b. Выведите гипотенузу треугольника с заданными катетами.

print((int(input()) ** 2 + int(input()) ** 2) ** 0.5)

'''import math
a = int(input())
b = int(input())
c = math.sqrt(a * a + b * b)
print(c)'''
